[
  {
    "nutrient_name": "Nitrogen",
    "nutrient_info": "Nitrogen is an essential macronutrient for plant function and is a key component of amino acids, which form the building blocks of plant proteins and enzymes.",
    "soilNCode": 1
  },
  {
    "nutrient_name": "Phosphorus",
    "nutrient_info": "Phosphorus is an essential nutrient for plants. It plays a critical role in cell development and is a key component of molecules that store energy. Insufficient phosphorus in the soil can result in a decreased crop yield.",
    "soilNCode": 2
  },
  {
    "nutrient_name": "Potassium",
    "nutrient_info": "Potassium also helps regulate the opening and closing of the stomata. If it is deficient or not supplied in adequate amounts, it stunts plant growth and reduces yield.",
    "soilNCode": 3
  },
  {
    "nutrient_name": "Calcium",
    "nutrient_info": "Calcium is an essential plant nutrient. It is required for structural roles in the cell wall and membranes, as a counter‐cation for inorganic and organic anions in the vacuole, and as an intracellular messenger in the cytosol",
    "soilNCode": 4
  },
  {
    "nutrient_name": "Magnesium",
    "nutrient_info": "Magnesium fulfills several functions within the plant. It is a central component of chlorophyll which is supporting the function to absorb sunlight during photosynthesis.",
    "soilNCode": 5
  },
  {
    "nutrient_name": "Sulphur",
    "nutrient_info": "Sulphur is essential for many growth functions in plants. Sulphur-deficient plants have short and/or spindly stems and yellowing of the young (top) leaves. With nitrogen deficiency, yellowing affects the older, lower leaves first.",
    "soilNCode": 6
  },
  {
    "nutrient_name": "Iron",
    "nutrient_info": "Iron is involved in the synthesis of chlorophyll, and it is essential for the maintenance of chloroplast structure and function.",
    "soilNCode": 7
  },
  {
    "nutrient_name": "Manganese",
    "nutrient_info": "Manganese is an important micronutrient for plant growth and development and sustains metabolic roles within different plant cell compartments.",
    "soilNCode": 8
  },
  {
    "nutrient_name": "Zinc",
    "nutrient_info": "Zinc is required for the metabolism of plants, enzyme function, and ion transport. Inadequate Zn availability in soil is a main consideration for plant nutrition, resulting in a significant loss in production and grain nutrient content.",
    "soilNCode": 9
  },
  {
    "nutrient_name": "Copper",
    "nutrient_info": "Copper is required for many enzymatic activities in plants and for chlorophyll and seed production. Deficiency of copper can lead to increased susceptibility to diseases like ergot, which can cause significant yield loss in small grains.",
    "soilNCode": 10
  },
  {
    "nutrient_name": "Boron",
    "nutrient_info": "Boron is related to cell wall development and resistance, cell division, fruit and seed development, sugar transport and hormone development.",
    "soilNCode": 11
  },
  {
    "nutrient_name": "Molybdenum",
    "nutrient_info": "Molybdenum primarily used in the production of “molybdoenzymes” that regulate various plant functions. It regulate nitrogen nutrition. In non-legumes, Mo-enzymes regulate the conversion of nitrate into proteins.",
    "soilNCode": 12
  }
]
